app/controllers/brands_controller.rb

    def create
      @brand = Brand.new(brand_params)
      if @brand.save
---
INSERT INTO "brands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test11"], ["created_at", "2023-07-20 15:16:09.130077"], ["updated_at", "2023-07-20 15:16:09.130077"]]

    def update
      if @brand.update(brand_params)
---
UPDATE "brands" SET "name" = ?, "updated_at" = ? WHERE "brands"."id" = ?  [["name", "test12"], ["updated_at", "2023-07-20 15:42:11.007941"], ["id", 1]]

    def destroy
      @brand = Brand.find(params[:id])
      if @brand.destroy
---
SELECT "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "brands" WHERE "brands"."id" = ?  [["id", 4]]

    def find_brand
      @brand = Brand.find(params[:id])
---
SELECT "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]