app/controllers/products_controller.rb

    def create
      @product = Product.new(product_params)
      if @product.save
---
INSERT INTO "products" ("name", "description", "brand_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asdas"], ["description", "asdasasd"], ["brand_id", 1], ["created_at", "2023-07-20 15:16:34.456089"], ["updated_at", "2023-07-20 15:16:34.456089"]]

    def update
      if @product.update(product_params)
---
UPDATE "products" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Çamaşır makinası"], ["description", "A11232 model numaralı makina"], ["updated_at", "2023-07-20 18:37:35.623636"], ["id", 4]]