app/views/products/_form.html.erb

      <%= form.label :brand_id, 'Marka' %>
      <%= form.collection_select :brand_id, Brand.all, :id, :name, { prompt: 'Bir marka seçin' }, { class: 'form-control' } %>
---
SELECT "brands".* FROM "brands"